vvkaggarwal12/stm32_bootloader/Core/Src/qspi.c
	/* Enable write operations ----------------------------------------- */
	QSPI_WriteEnable(&QSPIHandle);
//	CmdCplt = 0;
	TxCplt = 0;
	/* Writing Sequence ------------------------------------------------ */
	sCommand.Instruction = QUAD_IN_FAST_PROG_CMD;
	sCommand.AddressMode = QSPI_ADDRESS_1_LINE;
	sCommand.DataMode = QSPI_DATA_4_LINES;
	sCommand.NbData = size;

	if (HAL_QSPI_Command(&QSPIHandle, &sCommand, HAL_QPSI_TIMEOUT_DEFAULT_VALUE)
			!= HAL_OK) {
		return MEMORY_ERROR;
	}
//	while(CmdCplt == 0);
	if (HAL_QSPI_Transmit(&QSPIHandle, buffer, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
		return MEMORY_ERROR;
	}
//	while(TxCplt == 0);
	StatusMatch = 0x00;
	if (QSPI_AutoPollingMemReady(&QSPIHandle) != MEMORY_OK) {
		return MEMORY_ERROR;
	}
	while(StatusMatch == 0);
	return MEMORY_OK;
}

uint32_t ExternalFlashErase(uint32_t address) {
	QSPI_CommandTypeDef sCommand;

	CmdCplt = 0;
	/* Enable write operations ------------------------------------------- */
	QSPI_WriteEnable(&QSPIHandle);

	sCommand.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
	sCommand.AddressSize       = QSPI_ADDRESS_24_BITS;
	sCommand.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
	sCommand.DdrMode           = QSPI_DDR_MODE_DISABLE;
	sCommand.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
	sCommand.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

	/* Erasing Sequence -------------------------------------------------- */
	sCommand.Instruction = SECTOR_ERASE_CMD;
	sCommand.AddressMode = QSPI_ADDRESS_1_LINE;
	sCommand.Address = address;
	sCommand.DataMode = QSPI_DATA_NONE;
	sCommand.DummyCycles = 0;

	if (HAL_QSPI_Command_IT(&QSPIHandle, &sCommand) != HAL_OK) {
		return MEMORY_ERROR;
	}
	while(CmdCplt == 0);
	StatusMatch = 0x00;
	if (QSPI_AutoPollingMemReady(&QSPIHandle) != MEMORY_OK) {
		return MEMORY_ERROR;
	}
	while(StatusMatch == 0);
	return MEMORY_OK;
}

uint32_t ExternalFlashRead(uint32_t address, uint8_t *buffer, uint32_t size) {
	QSPI_CommandTypeDef sCommand;
	QSPI_MemoryMappedTypeDef sMemMappedCfg;
	uint16_t index;
	uint8_t *tempAddress = NULL;

	/* Enable write operations ----------------------------------------- */
	/* Configure Volatile Configuration register (with new dummy cycles) */
	QSPI_DummyCyclesCfg(&QSPIHandle);

	/* Reading Sequence ------------------------------------------------ */
	sCommand.Instruction = QUAD_OUT_FAST_READ_CMD;
	sCommand.DummyCycles = 10;

	sMemMappedCfg.TimeOutActivation = QSPI_TIMEOUT_COUNTER_DISABLE;

	if (HAL_QSPI_MemoryMapped(&QSPIHandle, &sCommand, &sMemMappedCfg)
			!= HAL_OK) {
		return MEMORY_ERROR;
	}

	tempAddress = (uint8_t*) (APPLICATION_ADDRESS + address);
	for (index = 0; index < size; index++) {
		buffer[index] = tempAddress[index];
	}

	return MEMORY_OK;
}

/**
 * @brief  Initializes and configure the QSPI interface.
 * @retval QSPI memory status
 */
static uint32_t QSPI_Startup(uint32_t Mode) {
	QSPIHandle.Instance = QUADSPI;

	/* QSPI initialization */
	/* ClockPrescaler set to 1, so QSPI clock = 200MHz / (1+3) = 50MHz */
	QSPIHandle.Init.ClockPrescaler = 9;
	QSPIHandle.Init.FifoThreshold = 1;
	QSPIHandle.Init.SampleShifting = QSPI_SAMPLE_SHIFTING_NONE;
	QSPIHandle.Init.FlashSize = 26;
	QSPIHandle.Init.ChipSelectHighTime = QSPI_CS_HIGH_TIME_3_CYCLE;
	QSPIHandle.Init.ClockMode = QSPI_CLOCK_MODE_0;
	QSPIHandle.Init.FlashID = QSPI_FLASH_ID_2;
	QSPIHandle.Init.DualFlash = QSPI_DUALFLASH_DISABLE;

    HAL_QSPI_DeInit(&QSPIHandle);
    if (HAL_QSPI_Init(&QSPIHandle) != HAL_OK)
    {
    	return MEMORY_ERROR;
    }

	/* Set the QSPI memory in 4-bytes address mode */
	if (QSPI_EnterFourBytesAddress(&QSPIHandle) != MEMORY_OK) {
		return MEMORY_ERROR;
	}

	return MEMORY_OK;
}

#if (BINARY_AREA == USE_SPI_NOR)
/**
 * @brief  De-Initializes and the QSPI interface.
 * @retval None
 */
static uint32_t QSPI_Shutdown(void) {
	/* Call the DeInit function to reset the driver */
	if (HAL_QSPI_DeInit(&QSPIHandle) != HAL_OK) {
		return MEMORY_ERROR;
	}

	/* System level De-initialization */
	QSPI_MspDeInit();

	return MEMORY_OK;
}

/**
 * @brief  Copy an amount of data from the QSPI memory to destination memory.
 * @param  WriteAddr: Pointer to data to be read
 * @param  ReadAddr: Read start address
 * @param  Size: Size of data to read
 * @retval QSPI memory status
 */
static uint32_t QSPI_Copy(uint32_t WriteAddr, uint32_t ReadAddr, uint32_t Size) {
	QSPI_CommandTypeDef s_command;

	/* Initialize the read command */
	s_command.InstructionMode = QSPI_INSTRUCTION_4_LINES;
	s_command.Instruction = QUAD_INOUT_FAST_READ_DTR_CMD; /* DTR QUAD INPUT/OUTPUT FAST READ and 4-BYTE DTR FAST READ commands */
	s_command.AddressMode = QSPI_ADDRESS_4_LINES;
	s_command.AddressSize = QSPI_ADDRESS_32_BITS;
	s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
	s_command.DataMode = QSPI_DATA_4_LINES;
	s_command.DummyCycles = MT25TL01G_DUMMY_CYCLES_READ_QUAD_DTR - 1;
	s_command.DdrMode = QSPI_DDR_MODE_ENABLE;
	s_command.DdrHoldHalfCycle = QSPI_DDR_HHC_HALF_CLK_DELAY;
	s_command.SIOOMode = QSPI_SIOO_INST_EVERY_CMD;

	while (Size) {
		s_command.NbData = (Size < 256) ? Size : 256;
		s_command.Address = ReadAddr;

		/* Configure the command */
		if (HAL_QSPI_Command(&QSPIHandle, &s_command,
				HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
			return MEMORY_ERROR;
		}

		/* Reception of the data */
		if (HAL_QSPI_Receive(&QSPIHandle, (uint8_t*) WriteAddr,
				HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
			return MEMORY_ERROR;
		}

		if (Size > 256) {
			Size -= 256;
			WriteAddr += 256;
			ReadAddr += 256;
		} else {
			Size = 0;
		}
	}

	return MEMORY_OK;
}
#endif /* (BINARY_AREA == USE_SPI_NOR) */

/**
 * @}
 */

/** @addtogroup QSPI_Private_Functions
 * @{
 */

#if (CODE_AREA == USE_QSPI)
/**
 * @brief  Configure the QSPI in memory-mapped mode
 * @retval QSPI memory status
 */
static uint32_t QSPI_EnableMemoryMappedMode(QSPI_HandleTypeDef *hqspi) {
	QSPI_CommandTypeDef s_command;
	QSPI_MemoryMappedTypeDef s_mem_mapped_cfg;

	/* Configure the command for the read instruction */
	s_command.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
	s_command.Instruction       = QUAD_INOUT_FAST_READ_CMD; /* DTR QUAD INPUT/OUTPUT FAST READ and 4-BYTE DTR FAST READ commands */
	s_command.AddressMode       = QSPI_ADDRESS_4_LINES;
	s_command.AddressSize       = QSPI_ADDRESS_24_BITS;
	s_command.AlternateBytesSize = QSPI_ALTERNATE_BYTES_8_BITS;
	s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
	s_command.DataMode          = QSPI_DATA_4_LINES;
	s_command.DummyCycles       = 10;
	s_command.NbData			= 0;
	s_command.Address			= 0;
	s_command.DdrMode           = QSPI_DDR_MODE_DISABLE;
	s_command.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
	s_command.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

	/* Configure the memory mapped mode */
	s_mem_mapped_cfg.TimeOutActivation = QSPI_TIMEOUT_COUNTER_DISABLE;
	s_mem_mapped_cfg.TimeOutPeriod = 0;

	if (HAL_QSPI_MemoryMapped(&QSPIHandle, &s_command, &s_mem_mapped_cfg)
			!= HAL_OK) {
		return MEMORY_ERROR;
	}

